In [71]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [72]:
# Read the CSV files into DataFrames.
sales_2020 = pd.read_csv('./Resources/athletic_sales_2020.csv')
sales_2021 = pd.read_csv('./Resources/athletic_sales_2021.csv')

In [73]:
# Display the 2020 sales DataFrame
sales_2020. head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [74]:
# Display the 2021 sales DataFrame
sales_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [75]:
# Check the 2020 sales data types.
sales_2020.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [76]:
# Check the 2021 sales data types.
sales_2021.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [77]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
sales = pd.concat([sales_2020,sales_2021],join='inner')
print (len(sales_2020))
print (len(sales_2021))
print (len(sales))

1297
8346
9643

In [78]:
# Check if any values are null.
sales.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [79]:
# Check the data type of each column
sales.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [80]:
# Convert the "invoice_date" to a datetime datatype
sales['invoice_date']= pd.to_datetime(sales.invoice_date,format='%m/%d/%y')

In [81]:
# Confirm that the "invoice_date" data type has been changed.
sales.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [82]:
# Show the number products sold for region, state, and city.
products_sold = pd.DataFrame(sales.groupby(['region', 'state', 'city'])['units_sold'].sum())
print(products_sold.head())
# Rename the sum to "Total_Products_Sold".
products_sold = pd.DataFrame(sales.groupby(['region', 'state', 'city'])['units_sold'].sum().reset_index(name='Total_Products_Sold'))
# Show the top 5 results.
top_5_products_sold = products_sold.sort_values(by='Total_Products_Sold', ascending=False).head()
print(top_5_products_sold)

                               units_sold
region  state    city
Midwest Illinois Chicago            25407
        Indiana  Indianapolis       26332
        Iowa     Des Moines         23446
        Kansas   Wichita            29463
        Michigan Detroit            50095
       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

#### Using `pivot_table`

In [83]:
# Show the number products sold for region, state, and city.
products_sold = pd.DataFrame(sales.groupby(['region', 'state', 'city'])['units_sold'].sum())
print(products_sold.head())
# Rename the "units_sold" column to "Total_Products_Sold"
products_sold = products_sold.rename(columns={'units_sold': 'Total_Products_Sold'})

# Show the top 5 results.
top_5_results = products_sold.sort_values(by='Total_Products_Sold', ascending=False).head()

                               units_sold
region  state    city
Midwest Illinois Chicago            25407
        Indiana  Indianapolis       26332
        Iowa     Des Moines         23446
        Kansas   Wichita            29463
        Michigan Detroit            50095

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [84]:
# Show the total sales for the products sold for each region, state, and city.
total_sales = pd.DataFrame(sales.groupby(['region', 'state', 'city'])['total_sales'].sum())
# Rename the "total_sales" column to "Total Sales"
total_sales = total_sales.rename(columns={'total_sales': 'Total Sales'})

# Show the top 5 results.
top_5_results = total_sales.sort_values(by='Total Sales', ascending=False).head()
print(top_5_results)

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [85]:
# Show the total sales for the products sold for each region, state, and city.
pivot_table_sales = pd.pivot_table(sales, 
                                   index=['region', 'state', 'city'], 
                                   values='total_sales', 
                                   aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_table_sales = pivot_table_sales.rename(columns={'total_sales': 'Total Sales'})

# Show the top 5 results.
top_5_results = pivot_table_sales.sort_values(by='Total Sales', ascending=False).head()

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [86]:
# Show the total sales for the products sold for each retailer, region, state, and city.
total_sales_by_retailer = sales.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum().reset_index()
print(total_sales_by_retailer.head())
# Rename the "total_sales" column to "Total Sales"
total_sales_by_retailer = total_sales_by_retailer.rename(columns={'total_sales': 'Total Sales'})

# Show the top 5 results.
top_5_results = total_sales_by_retailer.sort_values(by='Total Sales', ascending=False).head()

  retailer     region          state        city  total_sales
0   Amazon    Midwest           Ohio    Columbus     16835873
1   Amazon  Northeast          Maine    Portland      8611395
2   Amazon  Northeast  Massachusetts      Boston      4193590
3   Amazon  Northeast  New Hampshire  Manchester     10077142
4   Amazon  Northeast        Vermont  Burlington     13380463

#### Using `pivot_table`

In [87]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pivot_total_sales = pd.pivot_table(sales, 
                                   values='total_sales', 
                                   index=['retailer', 'region', 'state', 'city'], 
                                   aggfunc='sum').reset_index()

print(pivot_total_sales.head())

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_total_sales = pivot_total_sales.rename(columns={'total_sales': 'Total Sales'})

# Show the top 5 results.
print(pivot_total_sales.sort_values(by='Total Sales', ascending=False).head())

  retailer     region          state        city  total_sales
0   Amazon    Midwest           Ohio    Columbus     16835873
1   Amazon  Northeast          Maine    Portland      8611395
2   Amazon  Northeast  Massachusetts      Boston      4193590
3   Amazon  Northeast  New Hampshire  Manchester     10077142
4   Amazon  Northeast        Vermont  Burlington     13380463
        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [88]:
# Filter the sales data to get the women's athletic footwear sales data.
womens_footwear_sales = sales[sales['product'] == "Women's Athletic Footwear"]

#### Using `groupby`

In [89]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
womens_footwear_sales_summary = pd.DataFrame(sales[sales['product'] == "Women's Athletic Footwear"].groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index())
print(womens_footwear_sales_summary.head())
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
womens_footwear_sales_summary.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)

# Show the top 5 results.
top_5_results = womens_footwear_sales_summary.head()

  retailer     region          state        city  units_sold
0   Amazon    Midwest           Ohio    Columbus        5801
1   Amazon  Northeast          Maine    Portland        1841
2   Amazon  Northeast  Massachusetts      Boston        1190
3   Amazon  Northeast  New Hampshire  Manchester        3109
4   Amazon  Northeast        Vermont  Burlington        4327

#### Using `pivot_table`

In [90]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
pivot_table_womens_footwear = pd.pivot_table(sales[sales['product'] == "Women's Athletic Footwear"], 
                                            index=['retailer', 'region', 'state', 'city'],
                                            values='units_sold',
                                            aggfunc='sum').reset_index()

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pivot_table_womens_footwear.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)

# Show the top 5 results.
top_5_results = pivot_table_womens_footwear.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head()

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [91]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_table_daily_sales = pd.pivot_table(sales[sales['product'] == "Women's Athletic Footwear"],
                                        index='invoice_date',
                                        values='total_sales',
                                        aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_table_daily_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the table.
print(pivot_table_daily_sales.head())

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250

In [92]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales = pivot_table_daily_sales.resample('D').sum()
print(daily_sales)
# Sort the resampled pivot table in descending order on "Total Sales".
sorted_pivot_table = pivot_table_daily_sales.sort_values(by='Total Sales', ascending=False)
sorted_pivot_table

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-06              0
2020-01-07              0
2020-01-08              0
...                   ...
2021-12-26              0
2021-12-27              0
2021-12-28              0
2021-12-29              0
2021-12-30         167903

[727 rows x 1 columns]

              Total Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
...                   ...
2021-02-03          19210
2021-10-27          17916
2021-05-30          15406
2020-11-07           8974
2020-11-01           8974

[355 rows x 1 columns]

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [93]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales = pivot_table_daily_sales.resample('W').sum()
weekly_sales

# Sort the resampled pivot table in descending order on "Total Sales".
weekly_sales_sorted = weekly_sales.sort_values(by='Total Sales', ascending=False)
weekly_sales_sorted

              Total Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
...                   ...
2020-12-06          62801
2020-12-20          61710
2020-12-13          58916
2020-11-22          53940
2020-10-18              0

[105 rows x 1 columns]